import numpy as np
from scipy import linalg

A = np.array([[0.918, 0.000, 0.040, 0.030, 0.010, 0.000, 0.000, 0.000, 0.000, 0.002, 0.000, 0.000], 
              [0.918, 0.000, 0.000, 0.040, 0.030, 0.010, 0.000, 0.000, 0.000, 0.000, 0.002, 0.000],
              [0.000, 0.918, 0.000, 0.000, 0.040, 0.030, 0.010, 0.000, 0.000, 0.000, 0.000, 0.002],
              [0.000, 0.000, 0.918, 0.000, 0.000, 0.040, 0.030, 0.010, 0.000, 0.000, 0.000, 0.002],
              [0.000, 0.000, 0.000, 0.918, 0.000, 0.000, 0.040, 0.030, 0.010, 0.000, 0.000, 0.002],
              [0.000, 0.000, 0.000, 0.000, 0.918, 0.000, 0.000, 0.040, 0.030, 0.010, 0.000, 0.002],
              [0.000, 0.000, 0.000, 0.000, 0.000, 0.918, 0.000, 0.000, 0.040, 0.030, 0.010, 0.002],
              [0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.918, 0.000, 0.000, 0.040, 0.030, 0.012],
              [0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.918, 0.000, 0.000, 0.040, 0.042],
              [0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.918, 0.000, 0.000, 0.082],
              [0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.918, 0.000, 0.082],
              [0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.000, 0.918, 0.082]])

#за аналитичния подход 
A_11=np.linalg.matrix_power(A, 11)
print("varepsilon=min p_{i,j}^N>0, N=11:")
print(A_11.min())
print("Матрицата P^11")
print(A_11)

#числен подход
values, vectors= linalg.eig(A, left=True, right=False)
t=vectors[:, 7]
t=t/sum(t)
v=t

i=0
while i<11:
    v=np.vstack([v,t]) #матрица с редове стационарното разпределение
    i+=1


sum_=3*np.ones(12)

n=1
while max(sum_)>0.1:
    w=np.linalg.matrix_power(A, n)
    subtraction=np.abs(w-v)
    sum_ = np.sum(subtraction,axis=1).tolist() #списък със сумите (по редове) на отклоненията от компонентите 
                                               #на стационарното разпределение за съответната степен на матрицата на прехода
    n+=1
print("Суми по редове:")
print(sum_)
print("Брой стъпки:")
print(n-1)
